Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz1064dab288.h
extern volatile __C1FIFOINT13bits_t C1FIFOINT13bits __asm__ ("C1FIFOINT13") __attribute__((section("sfrs"), address(0xBF8806A0)));
extern volatile uint32_t        C1FIFOINT13CLR __attribute__((section("sfrs"),address(0xBF8806A4)));
extern volatile uint32_t        C1FIFOINT13SET __attribute__((section("sfrs"),address(0xBF8806A8)));
extern volatile uint32_t        C1FIFOINT13INV __attribute__((section("sfrs"),address(0xBF8806AC)));
#define C1FIFOUA13 C1FIFOUA13
extern volatile uint32_t   C1FIFOUA13 __attribute__((section("sfrs"), address(0xBF8806B0)));
extern volatile uint32_t        C1FIFOUA13CLR __attribute__((section("sfrs"),address(0xBF8806B4)));
extern volatile uint32_t        C1FIFOUA13SET __attribute__((section("sfrs"),address(0xBF8806B8)));
extern volatile uint32_t        C1FIFOUA13INV __attribute__((section("sfrs"),address(0xBF8806BC)));
#define C1FIFOCI13 C1FIFOCI13
extern volatile uint32_t   C1FIFOCI13 __attribute__((section("sfrs"), address(0xBF8806C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI13bits_t;
extern volatile __C1FIFOCI13bits_t C1FIFOCI13bits __asm__ ("C1FIFOCI13") __attribute__((section("sfrs"), address(0xBF8806C0)));
extern volatile uint32_t        C1FIFOCI13CLR __attribute__((section("sfrs"),address(0xBF8806C4)));
extern volatile uint32_t        C1FIFOCI13SET __attribute__((section("sfrs"),address(0xBF8806C8)));
extern volatile uint32_t        C1FIFOCI13INV __attribute__((section("sfrs"),address(0xBF8806CC)));
#define C1FIFOCON14 C1FIFOCON14
extern volatile uint32_t   C1FIFOCON14 __attribute__((section("sfrs"), address(0xBF8806D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON14bits_t;
extern volatile __C1FIFOCON14bits_t C1FIFOCON14bits __asm__ ("C1FIFOCON14") __attribute__((section("sfrs"), address(0xBF8806D0)));
extern volatile uint32_t        C1FIFOCON14CLR __attribute__((section("sfrs"),address(0xBF8806D4)));
extern volatile uint32_t        C1FIFOCON14SET __attribute__((section("sfrs"),address(0xBF8806D8)));
extern volatile uint32_t        C1FIFOCON14INV __attribute__((section("sfrs"),address(0xBF8806DC)));
#define C1FIFOINT14 C1FIFOINT14
extern volatile uint32_t   C1FIFOINT14 __attribute__((section("sfrs"), address(0xBF8806E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT14bits_t;
extern volatile __C1FIFOINT14bits_t C1FIFOINT14bits __asm__ ("C1FIFOINT14") __attribute__((section("sfrs"), address(0xBF8806E0)));
extern volatile uint32_t        C1FIFOINT14CLR __attribute__((section("sfrs"),address(0xBF8806E4)));
extern volatile uint32_t        C1FIFOINT14SET __attribute__((section("sfrs"),address(0xBF8806E8)));
extern volatile uint32_t        C1FIFOINT14INV __attribute__((section("sfrs"),address(0xBF8806EC)));
#define C1FIFOUA14 C1FIFOUA14
extern volatile uint32_t   C1FIFOUA14 __attribute__((section("sfrs"), address(0xBF8806F0)));
extern volatile uint32_t        C1FIFOUA14CLR __attribute__((section("sfrs"),address(0xBF8806F4)));
extern volatile uint32_t        C1FIFOUA14SET __attribute__((section("sfrs"),address(0xBF8806F8)));
extern volatile uint32_t        C1FIFOUA14INV __attribute__((section("sfrs"),address(0xBF8806FC)));
#define C1FIFOCI14 C1FIFOCI14
extern volatile uint32_t   C1FIFOCI14 __attribute__((section("sfrs"), address(0xBF880700)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI14bits_t;
extern volatile __C1FIFOCI14bits_t C1FIFOCI14bits __asm__ ("C1FIFOCI14") __attribute__((section("sfrs"), address(0xBF880700)));
extern volatile uint32_t        C1FIFOCI14CLR __attribute__((section("sfrs"),address(0xBF880704)));
extern volatile uint32_t        C1FIFOCI14SET __attribute__((section("sfrs"),address(0xBF880708)));
extern volatile uint32_t        C1FIFOCI14INV __attribute__((section("sfrs"),address(0xBF88070C)));
#define C1FIFOCON15 C1FIFOCON15
extern volatile uint32_t   C1FIFOCON15 __attribute__((section("sfrs"), address(0xBF880710)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON15bits_t;
extern volatile __C1FIFOCON15bits_t C1FIFOCON15bits __asm__ ("C1FIFOCON15") __attribute__((section("sfrs"), address(0xBF880710)));
extern volatile uint32_t        C1FIFOCON15CLR __attribute__((section("sfrs"),address(0xBF880714)));
extern volatile uint32_t        C1FIFOCON15SET __attribute__((section("sfrs"),address(0xBF880718)));
extern volatile uint32_t        C1FIFOCON15INV __attribute__((section("sfrs"),address(0xBF88071C)));
#define C1FIFOINT15 C1FIFOINT15
extern volatile uint32_t   C1FIFOINT15 __attribute__((section("sfrs"), address(0xBF880720)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT15bits_t;
extern volatile __C1FIFOINT15bits_t C1FIFOINT15bits __asm__ ("C1FIFOINT15") __attribute__((section("sfrs"), address(0xBF880720)));
extern volatile uint32_t        C1FIFOINT15CLR __attribute__((section("sfrs"),address(0xBF880724)));
extern volatile uint32_t        C1FIFOINT15SET __attribute__((section("sfrs"),address(0xBF880728)));
extern volatile uint32_t        C1FIFOINT15INV __attribute__((section("sfrs"),address(0xBF88072C)));
#define C1FIFOUA15 C1FIFOUA15
extern volatile uint32_t   C1FIFOUA15 __attribute__((section("sfrs"), address(0xBF880730)));
extern volatile uint32_t        C1FIFOUA15CLR __attribute__((section("sfrs"),address(0xBF880734)));
extern volatile uint32_t        C1FIFOUA15SET __attribute__((section("sfrs"),address(0xBF880738)));
extern volatile uint32_t        C1FIFOUA15INV __attribute__((section("sfrs"),address(0xBF88073C)));
#define C1FIFOCI15 C1FIFOCI15
extern volatile uint32_t   C1FIFOCI15 __attribute__((section("sfrs"), address(0xBF880740)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI15bits_t;
extern volatile __C1FIFOCI15bits_t C1FIFOCI15bits __asm__ ("C1FIFOCI15") __attribute__((section("sfrs"), address(0xBF880740)));
extern volatile uint32_t        C1FIFOCI15CLR __attribute__((section("sfrs"),address(0xBF880744)));
extern volatile uint32_t        C1FIFOCI15SET __attribute__((section("sfrs"),address(0xBF880748)));
extern volatile uint32_t        C1FIFOCI15INV __attribute__((section("sfrs"),address(0xBF88074C)));
#define C1FIFOCON16 C1FIFOCON16
extern volatile uint32_t   C1FIFOCON16 __attribute__((section("sfrs"), address(0xBF880750)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON16bits_t;
